code/app/Controllers/Admin/AdminController.php

    public function login(){
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        // $session = session();
        $user = new \App\Models\User();
        $user = $user->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1